Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/lwip-network-interface-integration/source/cy_lwip_dhcp_server.c
    /* Loop endlessly */
    while ( server->quit == false )
    {
        uint16_t       data_length = 0;
        uint16_t       available_data_length = 0;
        dhcp_header_t  *request_header;

        /* Sleep until the data is received from the socket */
        if (udp_receive(&server->socket, &received_packet, WAIT_FOREVER) != CY_RSLT_SUCCESS)
        {
            continue;
        }

        /* Get a pointer to the data in the packet */
        packet_get_data(received_packet, 0, (uint8_t**) &request_header, &data_length, &available_data_length);

        if (data_length != available_data_length)
        {
            /* Fragmented packets are not supported */
            packet_delete(received_packet);
            continue;
        }

        /* Check if the received data length is at least the size of dhcp_header_t. */
        /* The Options field in the DHCP header is of variable length. Look for the "DHCP Message Type" option that is 3 octets in size (code, length and type). */
        if (data_length < (sizeof(dhcp_header_t) - sizeof(request_header->options) + 3))
        {
            packet_delete(received_packet);
            continue;
        }

        /* Check if the option in the DHCP header is "DHCP Message Type", code value for the "DHCP Message Type" option is 53 as per RFC2132 */
        if (request_header->options[0] != DHCP_MESSAGETYPE_OPTION_CODE)
        {
            packet_delete(received_packet);
            continue;
        }

        /* Check the DHCP command */
        switch (request_header->options[2])
        {
            case DHCPDISCOVER:
            {
                dhcp_header_t           *reply_header   = NULL;
                uint16_t                available_space = 0;
                cy_lwip_mac_addr_t      client_mac_address;
                cy_lwip_ip_address_t    client_ip_address;
                uint32_t                temp;

                cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): DHCPDISCOVER \n", __FUNCTION__ );
                /* Create the reply packet */
                if (packet_create_udp(&transmit_packet, (uint8_t**) &reply_header, &available_space) != CY_RSLT_SUCCESS)
                {
                    /* Cannot reply - release the incoming packet */
                    packet_delete( received_packet );
                    break;
                }

                /* Copy the DHCP header content from the received discover packet into the reply packet */
                memcpy(reply_header, request_header, sizeof(dhcp_header_t) - sizeof(reply_header->options));

                /* Finished with the received discover packet - release it */
                packet_delete(received_packet);

                /* Now construct the OFFER response */
                reply_header->opcode = BOOTP_OP_REPLY;

                /* Clear the DHCP options list */
                memset( &reply_header->options, 0, sizeof( reply_header->options ) );

                /* Record the client MAC address */
                memcpy( &client_mac_address, request_header->client_hardware_addr, sizeof( client_mac_address ) );

                /* Check whether the device is already cached */
                if (!get_client_ip_address_from_cache( &client_mac_address, &client_ip_address ))
                {
                    /* Address not found in cache. Use the next available IP address */
                    client_ip_address.version = CY_LWIP_IP_VER_V4;
                    client_ip_address.ip.v4   = next_available_ip_addr;
                }

                /* Create the IP address for the offer */
                temp = htonl(client_ip_address.ip.v4);
                memcpy(reply_header->your_ip_addr, &temp, sizeof(temp));

                /* Copy the magic DHCP number */
                memcpy(reply_header->magic, dhcp_magic_cookie, 4);

                /* Add options */
                option_ptr     = (char *) &reply_header->options;
                option_ptr     = MEMCAT( option_ptr, dhcp_offer_option_buff, 3 );                                   /* DHCP message type            */
                option_ptr     = MEMCAT( option_ptr, server_ip_addr_option_buff, 6 );                               /* Server identifier            */
                option_ptr     = MEMCAT( option_ptr, lease_time_option_buff, 6 );                                   /* Lease time                   */
                option_ptr     = MEMCAT( option_ptr, subnet_mask_option_buff, 6 );                                  /* Subnet mask                  */
                option_ptr     = (char*)MEMCAT( option_ptr, wpad_option_buff, sizeof(wpad_option_buff) );           /* Web proxy auto-discovery URL */
                /* Copy the local IP address into the router & DNS server options */
                memcpy( option_ptr, server_ip_addr_option_buff, 6 );                                                /* Router (gateway)             */
                option_ptr[0]  = 3;                                                                                 /* Router ID                    */
                option_ptr    += 6;
                memcpy( option_ptr, server_ip_addr_option_buff, 6 );                                                /* DNS server                   */
                option_ptr[0]  = 6;                                                                                 /* DNS server ID                */
                option_ptr    += 6;
                option_ptr     = MEMCAT( option_ptr, mtu_option_buff, 4 );                                          /* Interface MTU                */
                option_ptr[0]  = (char) DHCP_END_OPTION_CODE;                                                       /* End options                  */
                option_ptr++;

                /* Send OFFER reply packet */
                packet_set_data_end(transmit_packet, (uint8_t*) option_ptr);
                if (cy_udp_send(&server->socket, &broadcast_addr, IPPORT_DHCPC, transmit_packet) != CY_RSLT_SUCCESS)
                {
                    packet_delete(transmit_packet);
                }
            }
            break;

            case DHCPREQUEST:
            {
                cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): DHCPREQUEST \n", __FUNCTION__ );
                /* REQUEST command - send back ACK or NAK */
                uint32_t                temp;
                dhcp_header_t           *reply_header;
                uint16_t                available_space;
                cy_lwip_mac_addr_t      client_mac_address;
                cy_lwip_ip_address_t    given_ip_address;
                cy_lwip_ip_address_t    requested_ip_address;
                bool                    next_avail_ip_address_used = false;
                const uint8_t           *find_option_ptr;

                /* Check if the REQUEST is for this server */
                find_option_ptr = find_option( request_header, DHCP_SERVER_IDENTIFIER_OPTION_CODE );
                if ( ( find_option_ptr != NULL ) && ( GET_IPV4_ADDRESS( local_ip_address ) != htobe32( LWIP_MAKEU32( find_option_ptr[3], find_option_ptr[2], find_option_ptr[1], find_option_ptr[0] ) ) ) )
                {
                    break; /* Server ID does not match the local IP address */
                }

                /* Create the reply packet */
                if ( packet_create_udp(&transmit_packet, (uint8_t**) &reply_header, &available_space ) != CY_RSLT_SUCCESS )
                {
                    /* Cannot reply - release the incoming packet */
                    packet_delete( received_packet );
                    break;
                }

                /* Copy the DHCP header content from the received request packet into the reply packet */
                memcpy( reply_header, request_header, sizeof(dhcp_header_t) - sizeof(reply_header->options) );
                
                /* Initialize requested address*/
                memset( &requested_ip_address, 0, sizeof(requested_ip_address));
                
